code-at-heroku/bloc/tfe-api-be-2020-11-16/lib/tasks/scrape.rake

task scrape: :environment do
    puts 'FETCHING LISTINGS'

    #require 'OpenURI.open'

    URL = 'https://www.indeed.com/jobs?q=internship&l=United+States'
    doc = Nokogiri::HTML(URI.open(URL))
    postings = doc.search('div.jobsearch-SerpJobCard')
    num = 0
    page = 1

    while num <= 90
      pagination_url = "https://www.indeed.com/jobs?q=internship&l=United+States&start=#{num}"
      puts ''
      puts pagination_url
      puts "Page: #{page}"
      doc = Nokogiri::HTML(URI.open(pagination_url))
      postings = doc.search('div.jobsearch-SerpJobCard')
      postings.each do |p|
        job_title = p.search('h2 a')[0].attributes["title"].value.gsub(/\n/, "")
        company = p.search('span.company').text.gsub(/\n/, "")
        location1 = p.search('div.location').text.gsub(/\n/, "")
        location2 = p.search('span.location').text.gsub(/\n/, "")
        location = location1 + location2
        summary = p.search('div.summary').text.gsub(/\n/, "")
        url = "https://indeed.com" + p.search('h2 a')[0].attributes["href"].value.gsub(/\n/, "")

        # skip persisting job if it already exists in db
        if Intern.where(job_title:job_title, company:company, location:location, summary:summary, url:url).count <= 0
          Intern.create(
            job_title:job_title,
            company:company,
            location:location,
            summary:summary,
            url:url)
---
SELECT COUNT(*) FROM "interns" WHERE "interns"."job_title" = $1 AND "interns"."company" = $2 AND "interns"."location" = $3 AND "interns"."summary" = $4 AND "interns"."url" = $5
INSERT INTO "interns" ("job_title", "company", "location", "summary", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"